Repository: threadi/external-files-from-google-cloud-storage
Catalog: languages/external-files-from-google-cloud-storage-*_formal.po
Languages: de_de

source: External files from Google Cloud Storage in Media Library
de_de: Externe Dateien aus dem Google Cloud Storage in der Mediathek

source: Extends External files in Media Library for usage of Google Cloud Storage.
de_de: Erweitere Externe Dateien in der Mediathek mit Google Cloud Storage.

source: Choose file(s) from your Google Cloud Storage
de_de: Wähle Datei(en) von deinem Google Cloud Storage

source: Authentication JSON
de_de: Authentifizierung JSON

source: Get the authentication JSON by editing your service account <a href="%1$s" target="_blank">here (opens in a new window)</a>.
de_de: Rufe die Authentifizierungs-JSON ab, indem du dein Dienstkonto <a href="%1$s" target="_blank">hier</a> bearbeitest <a href="%1$s" target="_blank">(wird in einem neuen Fenster geöffnet)</a>.

source: Set the name of the bucket to use for external files. Leave this field empty if you want to connect to different buckets.
de_de: Lege den Namen des Buckets fest, der für externe Dateien verwendet werden soll. Lasse dieses Feld leer, wenn du eine Verbindung zu verschiedenen Buckets herstellen möchtest.

source: Files in storage
de_de: Dateien im Speicher

source: View and import files
de_de: Zeige und importiere Dateien

source: Hint
de_de: Hinweis

source: Each user will find its settings in his own <a href="%1$s">user profile</a>.
de_de: Jeder Benutzer findet seine Einstellungen in seinem eigenem <a href="%1$s">Benutzerprofil</a>.

source: <strong>Given JSON is not valid!</strong> Please use the JSON given to you by Google Cloud.
de_de: <strong>Die angegebene JSON-Datei ist ungültig!</strong> Bitte verwende die von Google Cloud bereitgestellte JSON-Datei.

source: Google Cloud Storage object could not be loaded. Take a look at the <a href="%1$s" target="_blank">log</a> for more information.
de_de: Das Google Cloud Storage-Objekt konnte nicht geladen werden. Weitere Informationen findest du im <a href="%1$s" target="_blank">Protokoll</a>.

source: Google Cloud Storage bucket does not exist.
de_de: Der Google Cloud Storage-Bucket existiert nicht.

source: Given bucket does not exist.
de_de: Der angegebene Bucket existiert nicht.

source: Google Cloud Storage bucket could not be loaded:
de_de: Der Google Cloud Storage-Bucket konnte nicht geladen werden:

source: Google Cloud Storage bucket could not be loaded. Take a look at the <a href="%1$s" target="_blank">log</a> for more information.
de_de: Der Google Cloud Storage-Bucket konnte nicht geladen werden. Weitere Informationen finden Sie im <a href="%1$s" target="_blank">Protokoll</a>.

source: Import
de_de: Importieren

source: File-type is not supported
de_de: Dateityp wird nicht unterstützt

source: Go to your bucket
de_de: Gehe zu deinem Bucket

source: Settings
de_de: Einstellungen

source: Save active directory as your external source
de_de: Speichere das aktuelle Verzeichnis als externe Quelle

source: Error occurred during requesting the credential file for Google Cloud Storage.
de_de: Beim Abrufen der Anmeldedatei für Google Cloud Storage ist ein Fehler aufgetreten.

source: The following error occurred during requesting the credential file for Google Cloud Storage:
de_de: Beim Abrufen der Anmeldedatei für Google Cloud Storage ist ein Fehler aufgetreten:

source: Enter your authentication JSON here
de_de: Gib hier deine Authentifizierungs-JSON ein

source: Your bucket
de_de: Dein Bucket

source: Connect to your Google Cloud Storage
de_de: Verbinde zu deinem Google Cloud Storage

source: Enter your access credentials
de_de: Gibt deine Zugangsdaten ein

source: An authentication JSON has already been set by an administrator in the plugin settings. Just connect for show the files.
de_de: Eine Authentifizierungs-JSON wurde bereits von einem Administrator in den Plugin-Einstellungen festgelegt. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: An authentication JSON must be set by an administrator in the plugin settings.
de_de: Eine Authentifizierungs-JSON muss von einem Administrator in den Plugin-Einstellungen festgelegt werden.

source: Set your authentication JSON <a href="%1$s">here</a>.
de_de: Lege deine Authentifizierungs-JSON <a href="%1$s">hier</a> fest.

source: Your access token is already set <a href="%1$s">here</a>. Just connect for show the files.
de_de: Dein Zugriffstoken ist bereits <a href="%1$s">hier</a> eingerichtet. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: Set your authentication JSON <a href="%1$s">in your profile</a>.
de_de: Lege deine Authentifizierungs-JSON <a href="%1$s">in deinem Profil</a> fest.

source: Your authentication JSON is already set <a href="%1$s">in your profile</a>. Just connect for show the files.
de_de: Deine Authentifizierungs-JSON ist bereits <a href="%1$s">in deinem Profil</a> festgelegt. Stelle einfach eine Verbindung her, um die Dateien anzuzeigen.

source: Get the authentication JSON by editing your service account <a href="%1$s" target="_blank">here</a> and enter the name of the bucket you want to connect to.
de_de: Rufe die Authentifizierungs-JSON ab, indem du dein Dienstkonto <a href="%1$s" target="_blank">hier</a> bearbeitest und den Namen des Buckets eingibst, mit dem du dich verbinden möchtest.

source: Error during request of Google Cloud Storage IAM infos:
de_de: Beim Abrufen der Informationen vom Google Cloud Storage ist ein Fehler aufgetreten:

source: Error during request of Google Cloud Storage IAM binding data:
de_de: Beim Abrufen der Informationen vom Google Cloud Storage ist ein Fehler aufgetreten:

source: Bucket seems not to be public. File will not be exported for your Google Cloud Storage.
de_de: Der Bucket scheint nicht öffentlich zu sein. Die Datei wird nicht in dein Google Cloud Storage exportiert.

source: Could not load file path for given attachment ID.
de_de: Der Dateipfad für die angegebene Anhang-ID konnte nicht geladen werden.

source: Given file does not exist:
de_de: Die angegebene Datei existiert nicht:

source: Specified URL already exist in your media library.
de_de: Die angegebene URL ist bereits in deiner Medienbibliothek vorhanden.

source: Error during request of file data from Google Cloud Storage:
de_de: Fehler beim Abrufen von Dateidaten aus Google Cloud Storage:

source: Error during request of file data from Google Cloud Storage. Check the <a href="%1$s" target="_blank">log</a> for detailed information.
de_de: Fehler beim Abrufen von Dateidaten aus Google Cloud Storage. Detaillierte Informationen findest du im <a href="%1$s" target="_blank">Protokoll</a>.

source: Error during request of Google Cloud Storage IAM binding data. Check the <a href="%1$s" target="_blank">log</a> for detailed information.
de_de: Fehler beim Abrufen der IAM-Bindungsdaten von Google Cloud Storage. Detaillierte Informationen findest du im <a href="%1$s" target="_blank">Protokoll</a>.
